#+begin_src emacs-lisp
;;; gnus-icalendar.el --- reply to iCalendar meeting requests  -*- lexical-binding:t -*-

;; Copyright (C) 2013-2020 Free Software Foundation, Inc.

;; Author: Jan Tatarik <Jan.Tatarik@gmail.com>
;; Keywords: mail, icalendar, org

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; To install:
;; (require 'gnus-icalendar)
;; (gnus-icalendar-setup)

;; to enable optional iCalendar->Org sync functionality
;; NOTE: both the capture file and the headline(s) inside must already exist
;; (setq gnus-icalendar-org-capture-file "~/org/notes.org")
;; (setq gnus-icalendar-org-capture-headline '("Calendar"))
;; (gnus-icalendar-org-setup)


;;; Code:

(require 'icalendar)
(require 'eieio)
(require 'gmm-utils)
(require 'mm-decode)
(require 'gnus-sum)
(require 'gnus-art)

(eval-when-compile (require 'cl-lib))

(defun gnus-icalendar-find-if (pred seq)
  (catch 'found
    (while seq
      (when (funcall pred (car seq))
        (throw 'found (car seq)))
      (pop seq))))

;;;
;;; ical-event
;;;

(defclass gnus-icalendar-event ()
  ((organizer :initarg :organizer
              :accessor gnus-icalendar-event:organizer
              :initform ""
              :type (or null string))
   (summary :initarg :summary
            :accessor gnus-icalendar-event:summary
            :initform ""
            :type (or null string))
   (description :initarg :description
* Creating icalendar events
Given an elisp event
#+begin_src emacs-lisp
(setq event #s(gnus-icalendar-event-request "fpi_314@gmx.de" "Test Termin" "Testbeschreibung
des EIntrags" "ATF8" (24286 10304) (24286 21104) nil "29307bda-6bfd-46d1-b971-9323af2e8332.kalender.gmx.net" "REQUEST" t required ("ferdinand.pieper@ims.uni-hannover.de") nil))
#+end_src

#+RESULTS:
: #s(gnus-icalendar-event-request "fpi_314@gmx.de" "Test Termin" "Testbeschreibung
: des EIntrags" "ATF8" (24286 10304) (24286 21104) nil "29307bda-6bfd-46d1-b971-9323af2e8332.kalender.gmx.net" "REQUEST" t required ("ferdinand.pieper@ims.uni-hannover.de") nil)

We want to create a request as this one:
#+begin_src text
BEGIN:VCALENDAR
PRODID:-//1&1 Mail & Media GmbH/WEB.DE Kalender Server
VERSION:2.0
CALSCALE:GREGORIAN
METHOD:REQUEST
BEGIN:VEVENT
DTSTAMP:20200516T135443Z
SUMMARY:Test Termin
DESCRIPTION:Testbeschreibung\ndes EIntrags
DTEND;TZID=Europe/Brussels:20200608T170000
DTSTART;TZID=Europe/Brussels:20200608T140000
ATTENDEE;PARTSTAT=NEEDS-ACTION;ROLE=REQ-PARTICIPANT;RSVP=TRUE;CN=ferdinand.pieper@ims.uni-hannover.de:MAILTO:ferdinand.pieper@ims.uni-hannover.de
LOCATION:ATF8
ORGANIZER;CN=Ferdinand Pieper:MAILTO:fpi_314@gmx.de
UID:29307bda-6bfd-46d1-b971-9323af2e8332.kalender.gmx.net
SEQUENCE:0
END:VEVENT
BEGIN:VTIMEZONE
TZID:Europe/Brussels
TZURL:http://tzurl.org/zoneinfo/Europe/Brussels
X-LIC-LOCATION:Europe/Brussels
BEGIN:DAYLIGHT
TZOFFSETFROM:+0100
TZOFFSETTO:+0200
TZNAME:CEST
DTSTART:19810329T020000
RRULE:FREQ=YEARLY;BYMONTH=3;BYDAY=-1SU
END:DAYLIGHT
BEGIN:STANDARD
TZOFFSETFROM:+0200
TZOFFSETTO:+0100
TZNAME:CET
DTSTART:19961027T030000
RRULE:FREQ=YEARLY;BYMONTH=10;BYDAY=-1SU
END:STANDARD
BEGIN:STANDARD
TZOFFSETFROM:+001730
TZOFFSETTO:+001730
TZNAME:BMT
DTSTART:18800101T000000
RDATE:18800101T000000
END:STANDARD
BEGIN:STANDARD
TZOFFSETFROM:+001730
TZOFFSETTO:+0000
TZNAME:WET
DTSTART:18920501T120000
RDATE:18920501T120000
END:STANDARD
BEGIN:STANDARD
TZOFFSETFROM:+0000
TZOFFSETTO:+0100
TZNAME:CET
DTSTART:19141108T000000
RDATE:19141108T000000
END:STANDARD
BEGIN:DAYLIGHT
TZOFFSETFROM:+0100
TZOFFSETTO:+0200
TZNAME:CEST
DTSTART:19160430T230000
RDATE:19160430T230000
RDATE:19170416T020000
RDATE:19180415T020000
RDATE:19400520T030000
RDATE:19430329T020000
RDATE:19440403T020000
RDATE:19450402T020000
RDATE:19460519T020000
RDATE:19770403T020000
RDATE:19780402T020000
RDATE:19790401T020000
RDATE:19800406T020000
END:DAYLIGHT
BEGIN:STANDARD
TZOFFSETFROM:+0200
TZOFFSETTO:+0100
TZNAME:CET
DTSTART:19161001T010000
RDATE:19161001T010000
RDATE:19170917T030000
RDATE:19180916T030000
RDATE:19421102T030000
RDATE:19431004T030000
RDATE:19440917T030000
RDATE:19450916T020000
RDATE:19461007T030000
RDATE:19770925T030000
RDATE:19781001T030000
RDATE:19790930T030000
RDATE:19800928T030000
RDATE:19810927T030000
RDATE:19820926T030000
RDATE:19830925T030000
RDATE:19840930T030000
RDATE:19850929T030000
RDATE:19860928T030000
RDATE:19870927T030000
RDATE:19880925T030000
RDATE:19890924T030000
RDATE:19900930T030000
RDATE:19910929T030000
RDATE:19920927T030000
RDATE:19930926T030000
RDATE:19940925T030000
RDATE:19950924T030000
END:STANDARD
BEGIN:STANDARD
TZOFFSETFROM:+0100
TZOFFSETTO:+0000
TZNAME:WET
DTSTART:19181111T120000
RDATE:19181111T120000
RDATE:19191005T000000
RDATE:19201024T000000
RDATE:19211026T000000
RDATE:19221008T000000
RDATE:19231007T000000
RDATE:19241005T000000
RDATE:19251004T000000
RDATE:19261003T000000
RDATE:19271002T000000
RDATE:19281007T030000
RDATE:19291006T030000
RDATE:19301005T030000
RDATE:19311004T030000
RDATE:19321002T030000
RDATE:19331008T030000
RDATE:19341007T030000
RDATE:19351006T030000
RDATE:19361004T030000
RDATE:19371003T030000
RDATE:19381002T030000
RDATE:19391119T030000
END:STANDARD
BEGIN:DAYLIGHT
TZOFFSETFROM:+0000
TZOFFSETTO:+0100
TZNAME:WEST
DTSTART:19190301T230000
RDATE:19190301T230000
RDATE:19200214T230000
RDATE:19210314T230000
RDATE:19220325T230000
RDATE:19230421T230000
RDATE:19240329T230000
RDATE:19250404T230000
RDATE:19260417T230000
RDATE:19270409T230000
RDATE:19280414T230000
RDATE:19290421T020000
RDATE:19300413T020000
RDATE:19310419T020000
RDATE:19320403T020000
RDATE:19330326T020000
RDATE:19340408T020000
RDATE:19350331T020000
RDATE:19360419T020000
RDATE:19370404T020000
RDATE:19380327T020000
RDATE:19390416T020000
RDATE:19400225T020000
END:DAYLIGHT
BEGIN:DAYLIGHT
TZOFFSETFROM:+0200
TZOFFSETTO:+0200
TZNAME:CEST
DTSTART:19440903T000000
RDATE:19440903T000000
END:DAYLIGHT
BEGIN:STANDARD
TZOFFSETFROM:+0100
TZOFFSETTO:+0100
TZNAME:CET
DTSTART:19770101T000000
RDATE:19770101T000000
END:STANDARD
END:VTIMEZONE
END:VCALENDAR
#+end_src

which can be parsed as this elisp structure:
#+begin_src emacs-lisp
(setq ical
'((VCALENDAR nil ((PRODID nil "-//1&1 Mail & Media GmbH/WEB.DE Kalender Server") (VERSION nil "2.0") (CALSCALE nil "GREGORIAN") (METHOD nil "REQUEST")) ((VEVENT nil ((DTSTAMP nil "20200516T135443Z") (SUMMARY nil "Test Termin") (DESCRIPTION nil "Testbeschreibung\\ndes EIntrags") (DTEND (TZID "Europe/Brussels") "20200608T170000") (DTSTART (TZID "Europe/Brussels") "20200608T140000") (ATTENDEE (PARTSTAT "NEEDS-ACTION" ROLE "REQ-PARTICIPANT" RSVP "TRUE" CN "ferdinand.pieper@ims.uni-hannover.de") "MAILTO:ferdinand.pieper@ims.uni-hannover.de") (LOCATION nil "ATF8") (ORGANIZER (CN "Ferdinand Pieper") "MAILTO:fpi_314@gmx.de") (UID nil "29307bda-6bfd-46d1-b971-9323af2e8332.kalender.gmx.net") (SEQUENCE nil "0")) nil) (VTIMEZONE nil ((TZID nil "Europe/Brussels") (TZURL nil "http://tzurl.org/zoneinfo/Europe/Brussels") (X-LIC-LOCATION nil "Europe/Brussels")) ((DAYLIGHT nil ((TZOFFSETFROM nil "+0100") (TZOFFSETTO nil "+0200") (TZNAME nil "CEST") (DTSTART nil "19810329T020000") (RRULE nil "FREQ=YEARLY;BYMONTH=3;BYDAY=-1SU")) nil) (STANDARD nil ((TZOFFSETFROM nil "+0200") (TZOFFSETTO nil "+0100") (TZNAME nil "CET") (DTSTART nil "19961027T030000") (RRULE nil "FREQ=YEARLY;BYMONTH=10;BYDAY=-1SU")) nil) (STANDARD nil ((TZOFFSETFROM nil "+001730") (TZOFFSETTO nil "+001730") (TZNAME nil "BMT") (DTSTART nil "18800101T000000") (RDATE nil "18800101T000000")) nil) (STANDARD nil ((TZOFFSETFROM nil "+001730") (TZOFFSETTO nil "+0000") (TZNAME nil "WET") (DTSTART nil "18920501T120000") (RDATE nil "18920501T120000")) nil) (STANDARD nil ((TZOFFSETFROM nil "+0000") (TZOFFSETTO nil "+0100") (TZNAME nil "CET") (DTSTART nil "19141108T000000") (RDATE nil "19141108T000000")) nil) (DAYLIGHT nil ((TZOFFSETFROM nil "+0100") (TZOFFSETTO nil "+0200") (TZNAME nil "CEST") (DTSTART nil "19160430T230000") (RDATE nil "19160430T230000") (RDATE nil "19170416T020000") (RDATE nil "19180415T020000") (RDATE nil "19400520T030000") (RDATE nil "19430329T020000") (RDATE nil "19440403T020000") (RDATE nil "19450402T020000") (RDATE nil "19460519T020000") (RDATE nil "19770403T020000") (RDATE nil "19780402T020000") (RDATE nil "19790401T020000") (RDATE nil "19800406T020000")) nil) (STANDARD nil ((TZOFFSETFROM nil "+0200") (TZOFFSETTO nil "+0100") (TZNAME nil "CET") (DTSTART nil "19161001T010000") (RDATE nil "19161001T010000") (RDATE nil "19170917T030000") (RDATE nil "19180916T030000") (RDATE nil "19421102T030000") (RDATE nil "19431004T030000") (RDATE nil "19440917T030000") (RDATE nil "19450916T020000") (RDATE nil "19461007T030000") (RDATE nil "19770925T030000") (RDATE nil "19781001T030000") (RDATE nil "19790930T030000") (RDATE nil "19800928T030000") (RDATE nil "19810927T030000") (RDATE nil "19820926T030000") (RDATE nil "19830925T030000") (RDATE nil "19840930T030000") (RDATE nil "19850929T030000") (RDATE nil "19860928T030000") (RDATE nil "19870927T030000") (RDATE nil "19880925T030000") (RDATE nil "19890924T030000") (RDATE nil "19900930T030000") (RDATE nil "19910929T030000") (RDATE nil "19920927T030000") (RDATE nil "19930926T030000") (RDATE nil "19940925T030000") (RDATE nil "19950924T030000")) nil) (STANDARD nil ((TZOFFSETFROM nil "+0100") (TZOFFSETTO nil "+0000") (TZNAME nil "WET") (DTSTART nil "19181111T120000") (RDATE nil "19181111T120000") (RDATE nil "19191005T000000") (RDATE nil "19201024T000000") (RDATE nil "19211026T000000") (RDATE nil "19221008T000000") (RDATE nil "19231007T000000") (RDATE nil "19241005T000000") (RDATE nil "19251004T000000") (RDATE nil "19261003T000000") (RDATE nil "19271002T000000") (RDATE nil "19281007T030000") (RDATE nil "19291006T030000") (RDATE nil "19301005T030000") (RDATE nil "19311004T030000") (RDATE nil "19321002T030000") (RDATE nil "19331008T030000") (RDATE nil "19341007T030000") (RDATE nil "19351006T030000") (RDATE nil "19361004T030000") (RDATE nil "19371003T030000") (RDATE nil "19381002T030000") (RDATE nil "19391119T030000")) nil) (DAYLIGHT nil ((TZOFFSETFROM nil "+0000") (TZOFFSETTO nil "+0100") (TZNAME nil "WEST") (DTSTART nil "19190301T230000") (RDATE nil "19190301T230000") (RDATE nil "19200214T230000") (RDATE nil "19210314T230000") (RDATE nil "19220325T230000") (RDATE nil "19230421T230000") (RDATE nil "19240329T230000") (RDATE nil "19250404T230000") (RDATE nil "19260417T230000") (RDATE nil "19270409T230000") (RDATE nil "19280414T230000") (RDATE nil "19290421T020000") (RDATE nil "19300413T020000") (RDATE nil "19310419T020000") (RDATE nil "19320403T020000") (RDATE nil "19330326T020000") (RDATE nil "19340408T020000") (RDATE nil "19350331T020000") (RDATE nil "19360419T020000") (RDATE nil "19370404T020000") (RDATE nil "19380327T020000") (RDATE nil "19390416T020000") (RDATE nil "19400225T020000")) nil) (DAYLIGHT nil ((TZOFFSETFROM nil "+0200") (TZOFFSETTO nil "+0200") (TZNAME nil "CEST") (DTSTART nil "19440903T000000") (RDATE nil "19440903T000000")) nil) (STANDARD nil ((TZOFFSETFROM nil "+0100") (TZOFFSETTO nil "+0100") (TZNAME nil "CET") (DTSTART nil "19770101T000000") (RDATE nil "19770101T000000")) nil)))))))
#+end_src

#+begin_src emacs-lisp :results raw
(setq event (car (icalendar--all-events ical)))
#+end_src

#+RESULTS:
(VEVENT nil ((DTSTAMP nil 20200516T135443Z) (SUMMARY nil Test Termin) (DESCRIPTION nil Testbeschreibung\ndes EIntrags) (DTEND (TZID Europe/Brussels) 20200608T170000) (DTSTART (TZID Europe/Brussels) 20200608T140000) (ATTENDEE (PARTSTAT NEEDS-ACTION ROLE REQ-PARTICIPANT RSVP TRUE CN ferdinand.pieper@ims.uni-hannover.de) MAILTO:ferdinand.pieper@ims.uni-hannover.de) (LOCATION nil ATF8) (ORGANIZER (CN Ferdinand Pieper) MAILTO:fpi_314@gmx.de) (UID nil 29307bda-6bfd-46d1-b971-9323af2e8332.kalender.gmx.net) (SEQUENCE nil 0)) nil)

Function is similar to ~gnus-icalendar-event-reply-from-buffer~.
#+begin_src emacs-lisp
(gnus-icalendar-event--build-reply-event-body event 'tentative '("ferdinand\\.pieper@ims\\.uni-hannover\\.de" "ferdinand\\.pieper@ims\\.uni-hannover\\.de"))
#+end_src

*** test
#+begin_src emacs-lisp
(setq testevent (gnus-icalendar-event :uid "7605a92a-5bfc-4b46-9e8c-93c41014de7e" :recur nil :location "webex" :description "testbeschreibung" :summary "New Event" :method "REQUEST" :organizer "ferdinand.pieper@ims.uni-hannover.de" :start-time '(24255 65520) :end-time '(24256 3584) :rsvp nil :participation-type 'non-participant :req-participants '("fpi_314@gmx.de") :opt-participants nil))
;; #s(gnus-icalendar-event "ferdinand.pieper@ims.uni-hannover.de" "New Event" "testbeschreibung" "webex" (24255 65520) (24256 3584) nil "7605a92a-5bfc-4b46-9e8c-93c41014de7e" "REQUEST" nil non-participant ("fpi_314@gmx.de") nil)

(setq testevent (gnus-icalendar-event :uid "7605a92a-5bfc-4b46-def-93c41014de7e" :recur nil :location "testplatz" :description "testbeschreibung" :summary "Pizza" :method "REQUEST" :organizer "fpi_314@gmx.de" :start-time '(24255 65520) :end-time '(24256 3584) :rsvp nil :participation-type 'non-participant :req-participants '("fer@pie.tf" "ferdinand.pieper@ims.uni-hannover.de") :opt-participants nil))
(setq testevent (gnus-icalendar-event :uid "7605a92a-5bfc-4b46-def-93d41014de7e" :recur nil :location "ATF8" :description "description" :summary "testevent" :method "REQUEST" :organizer "fer@pie.tf" :start-time (encode-time 0 0 10 18 5 2020) :end-time (encode-time 0 0 11 18 5 2020) :rsvp nil :participation-type 'opt-participant :req-participants '("fpi_314@gmx.net" "ferdinand.pieper@ims.uni-hannover.de") :opt-participants nil))
(let ((event (ical-event-to-ical testevent)))
  (gnus-icalendar-vcalendar event)
  )
;; (gnus-icalendar-message-insert-request testevent)
#+end_src

#+RESULTS:
#+begin_example
BEGIN:VCALENDAR
PRODID:Gnus
VERSION:2.0
METHOD:REQUEST
BEGIN:VTIMEZONE
TZID:CEST
BEGIN:DAYLIGHT
TZOFFSETFROM:+0100
TZOFFSETTO:+0200
TZNAME:CEST
DTSTART:19700329T020000
RRULE:FREQ=YEARLY;BYDAY=-1SU;BYMONTH=3
END:DAYLIGHT
BEGIN:STANDARD
TZOFFSETFROM:+0200
TZOFFSETTO:+0100
TZNAME:CET
DTSTART:19701025T030000
RRULE:FREQ=YEARLY;BYDAY=-1SU;BYMONTH=10
END:STANDARD
END:VTIMEZONE
BEGIN:VEVENT
DTSTAMP:20200517T142412Z
DTSTART:20200516T150000Z
DTEND:20200516T160000Z
SUMMARY:Pizza
DESCRIPTION:testbeschreibung
ATTENDEE;PARTSTAT=NEEDS-ACTION;ROLE=REQ-PARTICIPANT;RSVP=TRUE:mailto:fer@pie.tf
ATTENDEE;PARTSTAT=NEEDS-ACTION;ROLE=REQ-PARTICIPANT;RSVP=TRUE:mailto:ferdinand.pieper@ims.uni-hannover.de
LOCATION:testplatz
ORGANIZER:fpi_314@gmx.de
UID:7605a92a-5bfc-4b46-def-93c41014de7e
SEQUENCE:0
END:VEVENT
END:VCALENDAR
#+end_example
